Revit 2027 API
TrussMemberInfo.lockedToTruss Property
Whether the member is locked to the host truss.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool lockedToTruss { get; set; }
Public Property lockedToTruss As Boolean
	Get
	Set
public:
property bool lockedToTruss {
	bool get ();
	void set (bool value);
}
member lockedToTruss : bool with get, set
Property Value
Boolean
See Also
Reference
TrussMemberInfo Class
Autodesk.Revit.DB.Structure Namespace